<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"34261caa632d7b254443ad272572013047a4480775adf8b87da29273b5c2ac13","plan_job_ref":"Job Pull Request Checks #4798 at https://github.com/GSA-TTS/FAC/actions/runs/15352576599","plan_out_hash":"acabfac18c01083dc1d91214f847cef927a99c7ac3b84930b77f72ca7b067675","plan_hash":"7edff4c0ad6a8f72a49bfe715035439673681a65cb7fca0628c235f67eb983e5","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 3 to add, 15 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.staging.cloudfoundry_app.postgrest will be updated in-place
!~  resource "cloudfoundry_app" "postgrest" {
+       buildpacks                  = (known after apply)
!~      created_at                  = "2025-04-21T19:51:54Z" -> (known after apply)
!~      docker_image                = "ghcr.io/gsa-tts/fac/postgrest@sha256:80cb7dbcf58efcc5d65ff0a62ef012a8cf3b9959b751d2a548132796468a9123" -> "ghcr.io/gsa-tts/fac/postgrest@sha256:be3b6ab31a94e3e89f08edad40be0234ae0951e3297f2043d797c219165f5afa"
!~      enable_ssh                  = true -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "postgrest"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-staging-postgrest.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      stack                       = null -> (known after apply)
!~      updated_at                  = "2025-04-29T10:39:34Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.staging.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "ce880589-cfed-0c08-7225-d78834d31d26"

-       policy {
-           destination_app = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857" -> null
        }
-       policy {
-           destination_app = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857" -> null
        }
-       policy {
-           destination_app = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "c07fdedc-2e37-4572-80ba-fc04d5a087ed" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "c07fdedc-2e37-4572-80ba-fc04d5a087ed"
        }
    }

  # module.staging.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "b03ca21f-c8ff-335b-7ef7-89dd796c8e14"

-       policy {
-           destination_app = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "23cd75fe-c912-44e7-8999-4686eae30d72" -> null
        }
-       policy {
-           destination_app = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.staging.cloudfoundry_network_policy.logshipper-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "logshipper-network-policy" {
        id = "d79429a7-84f6-2576-fce2-e9479e71e48c"

-       policy {
-           destination_app = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "69025dbf-8d9c-4b1d-ab09-06ba137d1be1" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.staging.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
        id = "8be715dc-7035-f013-29a4-8233469c292a"

-       policy {
-           destination_app = "23cd75fe-c912-44e7-8999-4686eae30d72" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "c07fdedc-2e37-4572-80ba-fc04d5a087ed" -> null
        }
-       policy {
-           destination_app = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "c07fdedc-2e37-4572-80ba-fc04d5a087ed" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.staging.cloudfoundry_route.postgrest will be updated in-place
!~  resource "cloudfoundry_route" "postgrest" {
!~      destinations = [
-           {
-               app_id           = "52191574-dff1-47b7-888c-bd8ef8de3135" -> null
-               app_process_type = "web" -> null
-               id               = "97514684-4b86-4327-acfa-b2f1f7f5efb1" -> null
-               port             = 3000 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "caf12fc2-60a3-412b-b919-2416179b271e"
!~      updated_at   = "2025-04-21T19:51:59Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.cg-logshipper.cloudfoundry_app.logshipper_app will be updated in-place
!~  resource "cloudfoundry_app" "logshipper_app" {
!~      created_at                  = "2025-04-21T19:51:00Z" -> (known after apply)
!~      enable_ssh                  = true -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "logshipper"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-staging-logshipper.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "3de51d5be398426d06e6c738d964af3c631a368a1dcd68a58dc8212c56c5b9b9" -> "28f7a0bda5e5ef3edbd3f5a6308c42703bb9d2bff793be4acee0c0dae9887158"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-28T20:53:46Z" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # module.staging.module.cg-logshipper.cloudfoundry_route.logshipper_route will be updated in-place
!~  resource "cloudfoundry_route" "logshipper_route" {
!~      destinations = [
-           {
-               app_id           = "69025dbf-8d9c-4b1d-ab09-06ba137d1be1" -> null
-               app_process_type = "web" -> null
-               id               = "1793196f-4770-4065-9a8d-47af5789cd91" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "ea6986d2-46cd-4850-aff0-0e3c72d24e39"
!~      updated_at   = "2025-04-21T19:51:53Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:54:12Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:631e0ec843a85e2ea8d97eaae565b488a06db44e24ead5155af06573957c9023" -> "ghcr.io/gsa-tts/fac/clamav@sha256:a91de4d279315089f5466d4e5a47adb4ce39d7f7108f2e466cd7d46fc4849996"
!~      enable_ssh                      = true -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-04-29T10:40:05Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-05-01T10:39:15Z" -> (known after apply)
        }
    }

  # module.staging.module.fac-file-scanner.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.staging.module.fac-file-scanner.data.external.scannerzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "scannerzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-scanner.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "../shared/modules/scanner"
    }

  # module.staging.module.fac-file-scanner.cloudfoundry_app.scanner_app will be updated in-place
!~  resource "cloudfoundry_app" "scanner_app" {
!~      created_at                  = "2025-04-21T19:51:55Z" -> (known after apply)
!~      enable_ssh                  = true -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "fac-file-scanner"
!~      path                        = "../shared/modules/scanner/scanner.zip" -> (known after apply)
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-file-scanner-staging.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "c7af0a37e63f0545429647139e6cd329de697b1cef624f87e36f4db851db4ee2" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-04-24T10:52:23Z" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.staging.module.fac-file-scanner.cloudfoundry_route.scanner_route must be replaced
-/+ resource "cloudfoundry_route" "scanner_route" {
!~      created_at   = "2025-04-24T10:52:24Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "c07fdedc-2e37-4572-80ba-fc04d5a087ed" -> null
-               app_process_type = "web" -> null
-               id               = "c5e380df-deb6-42dd-a5f9-564548117ff3" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      updated_at   = "2025-04-24T10:52:24Z" -> (known after apply)
!~      url          = "fac-file-scanner-staging.apps.internal" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:54:12Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:631e0ec843a85e2ea8d97eaae565b488a06db44e24ead5155af06573957c9023" -> "ghcr.io/gsa-tts/fac/clamav@sha256:a91de4d279315089f5466d4e5a47adb4ce39d7f7108f2e466cd7d46fc4849996"
!~      enable_ssh                      = true -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging-fs.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-04-29T10:40:05Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2025-04-21T19:50:48Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      enable_ssh                  = true -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "https-proxy"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "gsa-tts-oros-fac-staging-egress-https-proxy.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "b484469dcfb5672a2891b928bf55728283205ede65f1c1322f0514d2eecae40b" -> "3d2b5f8f666c8db20d827f80aab549c465cdc67d52cf32c760a08d9ae371a09d"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-28T20:46:05Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.staging.module.https-proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "50343cba-d67f-4a5a-90a8-f6b2e978b8d6" -> null
-               app_process_type = "web" -> null
-               id               = "f0bc28bf-37ff-4a8a-8a53-9a86743ea50d" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "d2e8c906-3614-474f-869d-3f0e0a12cbbe"
!~      updated_at   = "2025-04-21T19:51:00Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
-               app_process_type = "web" -> null
-               id               = "203269d4-78a2-425f-bbac-2f96bd76b378" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "8dec12f0-4f36-4b17-8f5d-f3adfbc29544"
!~      updated_at   = "2025-04-21T19:51:48Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.fac-file-scanner.module.quarantine.data.cloudfoundry_service_plans.s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "s3" {
+       name                  = "basic"
+       service_offering_name = "s3"
+       service_plans         = (known after apply)
    }

  # module.staging.module.fac-file-scanner.module.quarantine.cloudfoundry_service_instance.bucket will be updated in-place
!~  resource "cloudfoundry_service_instance" "bucket" {
+       dashboard_url     = (known after apply)
        id                = "b4cf43f9-7ada-4c21-9d16-b340672e50ae"
!~      last_operation    = {
!~          created_at  = "2025-03-14T14:54:11Z" -> (known after apply)
+           description = (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "update" -> (known after apply)
!~          updated_at  = "2025-03-14T14:54:11Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "fac-file-scanner-quarantine"
!~      service_plan      = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806" -> (known after apply)
        tags              = [
            "s3",
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2025-03-14T14:54:11Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.staging.module.file_scanner_clamav.module.route.data.cloudfoundry_domain.domain will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "domain" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.module.route.data.cloudfoundry_org.org will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_org" "org" {
+       annotations = (known after apply)
+       created_at  = (known after apply)
+       id          = (known after apply)
+       labels      = (known after apply)
+       name        = "gsa-tts-oros-fac"
+       quota       = (known after apply)
+       suspended   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.module.route.data.cloudfoundry_space.space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "space" {
+       allow_ssh         = (known after apply)
+       annotations       = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       isolation_segment = (known after apply)
+       labels            = (known after apply)
+       name              = "staging"
+       org               = (known after apply)
+       quota             = (known after apply)
+       updated_at        = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route must be replaced
-/+ resource "cloudfoundry_route" "app_route" {
!~      created_at   = "2025-04-24T10:52:24Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "23cd75fe-c912-44e7-8999-4686eae30d72" -> null
-               app_process_type = "web" -> null
-               id               = "5aa8f09b-3029-4253-8e06-dcff0c7ae4c4" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      space        = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807" -> (known after apply) # forces replacement
!~      updated_at   = "2025-04-24T10:52:24Z" -> (known after apply)
!~      url          = "fac-av-staging-fs.apps.internal" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 3 to add, 15 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4798](https://github.com/GSA-TTS/FAC/actions/runs/15352576599)